Sorting

In [2]:
import pandas as pd

In [16]:
raw = {
    'name': ['Prakash', 'Darshan', 'Nishant'],
    'age': [22, 18, 18],
    'salary': [22000, 18000, 36000]
}
df = pd.DataFrame(data=raw)
df

      name  age  salary
0  Prakash   22   22000
1  Darshan   18   18000
2  Nishant   18   36000

In [14]:
# basic sorting
df.sort_values(by='name', ascending=True, inplace=True)
df

      name  age  salary
1  Darshan   18   18000
2  Nishant   12   36000
0  Prakash   22   22000

In [ ]:
# multiple column sorting
df.sort_values(by=['age', 'salary'], ascending=[True, False], inplace=True)
df

# how it works: at first it sort the age smaller to larger. nishant and darshan have same age, so it sort them on the basis of salary. since, nishant has more salary than darshan, nishant is at first

      name  age  salary
2  Nishant   18   36000
1  Darshan   18   18000
0  Prakash   22   22000

### Aggregation: basically, it is applying methods (summary methods)]

In [18]:
df['age'].mean()
df['salary'].min()
df['salary'].max()

np.int64(36000)

### Grouping: it create group based on the unique value.

In [22]:
df = pd.read_csv('../../practice_dataset.csv')
df

,ID,Name,Age,Gender,Department,Joining_Date,Salary,Performance_Score,Remote_Work
0,1.0,Person_1,56,Female,HR,2018-10-01,71919.0,Good,True
1,2.0,Person_2,46,Female,Finance,2020-06-09,35600.0,Average,False
2,3.0,Person_3,32,Male,IT,2019-03-15,59124.0,Excellent,False
3,4.0,Person_4,60,Male,HR,2015-05-27,57643.0,Good,False
4,5.0,Person_5,25,Male,HR,2023-10-25,70764.0,Average,False
...,...,...,...,...,...,...,...,...,...
95,96.0,Person_96,24,Male,Marketing,2020-09-05,62097.0,Excellent,True
96,97.0,Person_97,26,Female,Marketing,2015-08-14,43121.0,Good,True
97,98.0,Person_98,41,Female,Finance,2017-03-08,85071.0,NaN,False
98,NaN,Person_99,18,Male,Marketing,2021-05-20,40966.0,Excellent,False
99,100.0,Person_100,61,Female,Finance,2023-01-05,89326.0,Average,True

In [26]:
unique_dep = df['Department'].unique()
print(f'unique department: {unique_dep}')

unique department: ['HR' 'Finance' 'IT' nan 'Marketing']

In [ ]:
# how much salary is earned by each department
# group + aggregation

grouped = df.groupby('Department')['Salary']
print(grouped.sum())
print(grouped.min())
print(grouped.mean())
print(grouped.size())

Department
Finance      1384827.0
HR           1654655.0
IT           1230212.0
Marketing    1456183.0
Name: Salary, dtype: float64
Department
Finance      30301.0
HR           30784.0
IT           40647.0
Marketing    30190.0
Name: Salary, dtype: float64
Department
Finance      60209.869565
HR           63640.576923
IT           64748.000000
Marketing    58247.320000
Name: Salary, dtype: float64
Department
Finance      24
HR           26
IT           21
Marketing    26
Name: Salary, dtype: int64

Grouping based on multiple columns

In [41]:
df.groupby(['Department', 'Performance_Score'])['Salary'].sum()
df.groupby(['Department', 'Performance_Score'])['Salary'].count()

Department  Performance_Score
Finance     Average               3
            Excellent             8
            Good                  6
            Poor                  5
HR          Average               6
            Excellent             4
            Good                 11
            Poor                  5
IT          Average               4
            Excellent             5
            Good                  4
            Poor                  5
Marketing   Average               4
            Excellent            10
            Good                  3
            Poor                  8
Name: Salary, dtype: int64